import React, {  useRef, useEffect }  from 'react';
import './quizDesc.scss';

const QuizDescription = ({ onContinue }) => {
  const myInputRef = useRef(null);

  useEffect(() => {
    myInputRef.current.focus();
  }, []);

  return (
    <div className="rules-container">
        <div className="quiz-rules-container" ref={myInputRef}>
          <div style={{padding: '15px'}}>
<p style={{marginBottom: '10px'}}>Готові дізнатися більше про розвиток України у фарма-вимірі? </p>
<p style={{marginBottom: '10px'}}>Наша вікторина - це не просто гра, а шанс здобути класний подарунок!</p>
<p style={{marginBottom: '10px'}}>Ось кілька головних моментів, які варто взяти до уваги:</p>
</div>
            <ul>
            <li><b>Вікторина дружить зі здоровим ґлуздом!🧠</b> Ми підготували 10 питань. Та не поспішайте: у кожного питання лише одна правильна відповідь.</li>
                <li><b>Кожна правильна відповідь = 1 бал✅</b> Це Ваш шанс потрапити в ТОП-10 і виграти сертифікат у онлайн-магазин найкрутіших вишиванок України!</li>
                <li><b>А що, якщо переможців буде забагато?🤔</b> Якщо у нас буде багато учасників, які набрали максимальну кількість балів, визначимо переможців за допомогою рандомайзера. Шанси на перемогу у всіх рівні!</li>
                <li><b>Деталі важливі!📝</b> Якщо у Вас є шанс стати переможцем, переконайся, що Ви надали правильні контактні дані. Без цього ми не зможемо відправити Вам подарунок.</li>
                <li><b>Зверніть увагу!</b> Беручи участь у активності, Ви надаєте згоду на обробку персональних даних відповідно до Закону України «Про захист персональних даних».</li>
                <li><b>Найважливіше – це отримати задоволення!</b> Навчайтесь, розважайтесь і насолоджуйтесь кожним питанням. Слава Україні, слава нації! 🇺🇦✌️❤️</li>
            </ul>
            <button className="start-quiz-btn" onClick={() => onContinue()}>Розпочати <span className="arrow">➜</span></button>
        </div>
        </div>
  );
};

export default QuizDescription;
